In [1]:
# day_5_lab_9_solutions
# importing essntial libraries, just in case 

import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()

········

In [3]:
# establishing the connection
# create an engine
# declare dataframe

In [4]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)


Create a Python connection with SQL database and retrieve the results of the following queries as dataframes:

1. How many distinct (different) actors' last names are there?

In [5]:
last_name_actors = pd.read_sql_query('select distinct(last_name) from sakila.actor', engine)
last_name_actors.head(10)

   last_name
0     AKROYD
1      ALLEN
2    ASTAIRE
3     BACALL
4     BAILEY
5       BALE
6       BALL
7  BARRYMORE
8   BASINGER
9     BENING

2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

3. Get all films with ARMAGEDDON in the title.

In [9]:

film_titles = pd.read_sql_query('SELECT title AS "film_title" FROM sakila.film WHERE title LIKE 'ARMAGEDDON%' ', engine)
film_titles
# i got a lot of errors so i resorted to a hybrid solution as seen in the following cell..:

SyntaxError: invalid syntax (1795417538.py, line 1)

In [ ]:
film_titles = pd.read_sql_query('SELECT film_id, title AS "film_title" FROM sakila.film ', engine)
# film_titles.apply(lambda row: row.astype(str).str.contains('ARMAGEDDON').any(1), axis=1)

def search(regex: str, film_titles, case=False):
    """Search all the text columns of `df`, return rows with any matches."""
    textlikes = film_titles.select_dtypes(include=[object, "ARMAGEDDON"])
    return df[
        textlikes.apply(
            lambda column: column.str.contains(regex, regex=True, case=case, na=False)
        ).any(axis=1)
    ]
#search("ARMAGEDDON",film_titles)
#source: https://stackoverflow.com/questions/26640129/search-for-string-in-all-pandas-dataframe-columns-and-filter

4. Get 10 the longest films.

In [8]:
Longest_movies = pd.read_sql_query('SELECT DISTINCT length, title FROM sakila.film  ORDER BY length DESC ', engine)
Longest_movies.head(10)

   length               title
0     185       CHICAGO NORTH
1     185      CONTROL ANTHEM
2     185      DARN FORRESTER
3     185         GANGS PRIDE
4     185           HOME PITY
5     185       MUSCLE BRIGHT
6     185        POND SEATTLE
7     185  SOLDIERS EVOLUTION
8     185   SWEET BROTHERHOOD
9     185        WORST BANGER

5.How many films include Behind the Scenes content?

In [12]:
special_features = pd.read_sql_query('select title, special_features from sakila.film where special_features regexp ('Scenes$') and special_features regexp ('^Behind') ', engine)
special_features.head(10)

# still getting errors :(

SyntaxError: invalid syntax (1039759681.py, line 1)

6. Which kind of movies (rating) have a mean duration of more than two hours?

In [1]:
movie_duration = pd.read_sql_query('select rating as "movie rating", length as "Movie Length" from sakila.film \ 
group by rating having avg(length) >= 120', engine)
movie_duration.head(10)

SyntaxError: EOL while scanning string literal (3629961139.py, line 1)

7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [ ]:
movie_ranking = pd.read_sql_query('select title, count(*) AS length, rank() OVER (ORDER BY count(*) DESC) as Rank_Ranking \ 
from sakila.film group by title', engine)
movie_ranking.head(10)